In [1]:
import numpy as np
import pandas as pd

In [2]:
#imported movies and ratings data
movies = pd.read_csv('movies.dat', sep = '::', header = None )
ratings = pd.read_csv('ratings.dat', sep = '::',header = None )

C:\Users\dell\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

C:\Users\dell\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  This is separate from the ipykernel package so we can avoid doing imports until

In [3]:
movies.shape, ratings.shape

((3883, 3), (1000209, 4))

In [4]:
#naming the columns of each table
ratings.columns = ['User_id', 'Movie_id', 'Ratings', 'Timestamp']
movies.columns = ['Movie_id', 'Title', 'Genre']

In [5]:
#splitting the genre of movies table into 6 parts
category  =[]
for i in range(len(movies['Genre'])):
    category.append(movies['Genre'][i].split('|'))
    
category = pd.DataFrame(category)

In [6]:
category.columns = ['category 1','category 2', 'category 3','category 4','category 5','category 6']

In [7]:
#keeping only first 2 genre to to main movies table
movies['category 1'] = category['category 1']
movies['category 2'] = category['category 2']

In [8]:
movies.head()

,Movie_id,Title,Genre,category 1,category 2
0,1,Toy Story (1995),Animation|Children's|Comedy,Animation,Children's
1,2,Jumanji (1995),Adventure|Children's|Fantasy,Adventure,Children's
2,3,Grumpier Old Men (1995),Comedy|Romance,Comedy,Romance
3,4,Waiting to Exhale (1995),Comedy|Drama,Comedy,Drama
4,5,Father of the Bride Part II (1995),Comedy,Comedy,None

In [9]:
#removing genre column
movies.drop('Genre', inplace=True, axis =1)

In [10]:
movies.head()

   Movie_id                               Title category 1  category 2
0         1                    Toy Story (1995)  Animation  Children's
1         2                      Jumanji (1995)  Adventure  Children's
2         3             Grumpier Old Men (1995)     Comedy     Romance
3         4            Waiting to Exhale (1995)     Comedy       Drama
4         5  Father of the Bride Part II (1995)     Comedy        None

In [11]:
#grouping data of ratings on the basis of user ids
data = ratings.groupby('User_id')

In [12]:
#extracting the data of 1st user
user_1 = data.get_group(1)

In [13]:
user_1.shape

(53, 4)

In [14]:
#list if movies id watched by the extracted user
umid = user_1['Movie_id'].tolist()

In [15]:
len(umid)

53

In [16]:
#taking list of movies which got rating greater than 3
good_rate = user_1[user_1['Ratings']>3]

In [17]:
good_rate.head()

   User_id  Movie_id  Ratings  Timestamp
0        1      1193        5  978300760
3        1      3408        4  978300275
4        1      2355        5  978824291
6        1      1287        5  978302039
7        1      2804        5  978300719

In [18]:
#merging two tables to find out complete data of movies watched by the extracted user which rating above 3
data = pd.merge(movies, good_rate, on='Movie_id') 
data.head()

,Movie_id,Title,category 1,category 2,User_id,Ratings,Timestamp
0,1,Toy Story (1995),Animation,Children's,1,5,978824268
1,48,Pocahontas (1995),Animation,Children's,1,5,978824351
2,150,Apollo 13 (1995),Drama,None,1,5,978301777
3,260,Star Wars: Episode IV - A New Hope (1977),Action,Adventure,1,4,978300760
4,527,Schindler's List (1993),Drama,War,1,5,978824195

In [19]:
c1 = pd.DataFrame(data['category 1'])
c2 = pd.DataFrame(data['category 2'])
c1.columns = ['genre']
c2.columns = ['genre']

In [20]:
#finding the unique genre watche dthe user
genre = pd.concat([c1,c2], ignore_index = True)

In [21]:
genre.head()

       genre
0  Animation
1  Animation
2      Drama
3     Action
4      Drama

In [22]:
#finding count of how many times the user has watched each genre
genre_count = pd.value_counts(genre['genre'])
genre_count

Drama         19
Children's    17
Animation     14
Comedy         6
Action         4
Adventure      4
Musical        2
Crime          2
Thriller       1
Fantasy        1
War            1
Sci-Fi         1
Romance        1
Name: genre, dtype: int64

In [23]:
#most watched genre
top_genre= max(genre_count.items(), key = lambda x: x[1])
top_genre

('Drama', 19)

In [24]:
#data of rating table of ratings above 3
top_rated = ratings[(ratings['Ratings'] == 4) | (ratings['Ratings'] == 5)]

In [25]:
#data of all movie of most watched genre
recMovies = movies[(movies['category 1'] == top_genre[0]) | (movies['category 2'] == top_genre[0])]

In [26]:
# dataset = pd.merge(recMovies, top_rated, on='Movie_id') 
# dataset.head()

In [27]:
#mid1 = dataset['Movie_id']

In [28]:
#mid = mid1.drop_duplicates().tolist()

In [29]:
#len(mid)

In [30]:
# dataset = pd.merge(recMovies, top_rated, on='Movie_id') 
# dataset.head()

In [31]:
# dataset = dataset.drop_duplicates(subset='Movie_id',)
# dataset['Title'].head()

In [32]:
# dataset.shape

In [33]:
# dataset.head()

In [34]:
# recc = {'movie_id':[],'Movie_Name':[]}
# for i in range(len(dataset['Movie_id'])):
#     for j in range(len(data_1['Movie_id'])):
#         if dataset['Movie_id'].iloc[i] != data_1['Movie_id'].iloc[j]:
#             recc['movie_id'].append(recMovies['Movie_id'].iloc[i])
#             recc['Movie_Name'].append(recMovies['Title'].iloc[i])
#             #recc['Movie_Rating'].append(dataset['Ratings'].iloc[j])
#             #,'Movie_Rating':[]

In [35]:
# recc = pd.DataFrame(recc)

In [36]:
# recc = recc.drop_duplicates(subset='movie_id')

In [37]:
# recc.shape

In [38]:
# recc.head()

In [39]:
# Program to measure similarity between 
# two sentences using cosine similarity. 
# from nltk.corpus import stopwords 
# from nltk.tokenize import word_tokenize 

# X = input("Enter first string: ").lower() 
# Y = input("Enter second string: ").lower() 
# # X ="I love horror movies"
# # Y ="Lights out is a horror movie"

# # tokenization 
# X_list = word_tokenize(X) 
# Y_list = word_tokenize(Y) 

# # sw contains the list of stopwords 
# sw = stopwords.words('english') 
# l1 =[];l2 =[] 

# # remove stop words from string 
# X_set = {w for w in X_list if not w in sw} 
# Y_set = {w for w in Y_list if not w in sw} 

# # form a set containing keywords of both strings 
# rvector = X_set.union(Y_set) 
# for w in rvector: 
# 	if w in X_set: l1.append(1) # create a vector 
# 	else: l1.append(0) 
# 	if w in Y_set: l2.append(1) 
# 	else: l2.append(0) 
# c = 0

# # cosine formula 
# for i in range(len(rvector)): 
# 		c+= l1[i]*l2[i] 
# cosine = c / float((sum(l1)*sum(l2))**0.5) 
# print("similarity: ", cosine)

In [40]:
#merging two tables to get data of most watched genre with ratings above 3
exp = pd.merge(recMovies, top_rated, on='Movie_id') 
exp.head()

,Movie_id,Title,category 1,category 2,User_id,Ratings,Timestamp
0,4,Waiting to Exhale (1995),Comedy,Drama,187,4,977078862
1,4,Waiting to Exhale (1995),Comedy,Drama,476,5,976223366
2,4,Waiting to Exhale (1995),Comedy,Drama,528,4,980039670
3,4,Waiting to Exhale (1995),Comedy,Drama,601,4,975881747
4,4,Waiting to Exhale (1995),Comedy,Drama,987,4,975100580

In [41]:
#grouping data to find how many times the has been rated
ratings_count = exp.groupby(['Movie_id']).count()
ratings_count.head()

          Title  category 1  category 2  User_id  Ratings  Timestamp
Movie_id
4            37          37          37       37       37         37
11          698         698         698      698      698        698
14           85          85           0       85       85         85
16          437         437         437      437      437        437
17          632         632         632      632      632        632

In [42]:
#ratings_count.drop(axis=1,columns=['category 1','category 2','Title','User_id','Timestamp'], inplace=True)

In [43]:
ratings_count.head()

          Title  category 1  category 2  User_id  Ratings  Timestamp
Movie_id
4            37          37          37       37       37         37
11          698         698         698      698      698        698
14           85          85           0       85       85         85
16          437         437         437      437      437        437
17          632         632         632      632      632        632

In [44]:
#merging the count of ratings to the above data
exp1 = pd.merge(exp, ratings_count, on='Movie_id')

In [45]:
exp1.head()

,Movie_id,Title_x,category 1_x,category 2_x,User_id_x,Ratings_x,Timestamp_x,Title_y,category 1_y,category 2_y,User_id_y,Ratings_y,Timestamp_y
0,4,Waiting to Exhale (1995),Comedy,Drama,187,4,977078862,37,37,37,37,37,37
1,4,Waiting to Exhale (1995),Comedy,Drama,476,5,976223366,37,37,37,37,37,37
2,4,Waiting to Exhale (1995),Comedy,Drama,528,4,980039670,37,37,37,37,37,37
3,4,Waiting to Exhale (1995),Comedy,Drama,601,4,975881747,37,37,37,37,37,37
4,4,Waiting to Exhale (1995),Comedy,Drama,987,4,975100580,37,37,37,37,37,37

In [46]:
exp1 = exp1.rename(columns={"Ratings_x": "Ratings", "Ratings_y": "Ratings_count"})

In [47]:
#removing the duplicates on the basis of movie id
exp1 = exp1.drop_duplicates(subset='Movie_id')
exp1.head()

,Movie_id,Title_x,category 1_x,category 2_x,User_id_x,Ratings,Timestamp_x,Title_y,category 1_y,category 2_y,User_id_y,Ratings_count,Timestamp_y
0,4,Waiting to Exhale (1995),Comedy,Drama,187,4,977078862,37,37,37,37,37,37
37,11,"American President, The (1995)",Comedy,Drama,34,4,978103264,698,698,698,698,698,698
735,14,Nixon (1995),Drama,None,8,4,978230756,85,85,0,85,85,85
820,16,Casino (1995),Drama,Thriller,8,4,978230095,437,437,437,437,437,437
1257,17,Sense and Sensibility (1995),Drama,Romance,6,4,978236383,632,632,632,632,632,632

In [48]:
#finding the average rating of all movies
C = exp1['Ratings'].mean()
print(C)

4.339912280701754

In [49]:
#find quantile of count of ratings
m = exp1['Ratings_count'].quantile(0.90)
print(m)

414.29999999999995

In [50]:
q_movies = exp1.copy().loc[exp1['Ratings_count'] >= m]
q_movies.shape

(137, 13)

In [51]:
q_movies.head()

,Movie_id,Title_x,category 1_x,category 2_x,User_id_x,Ratings,Timestamp_x,Title_y,category 1_y,category 2_y,User_id_y,Ratings_count,Timestamp_y
37,11,"American President, The (1995)",Comedy,Drama,34,4,978103264,698,698,698,698,698,698
820,16,Casino (1995),Drama,Thriller,8,4,978230095,437,437,437,437,437,437
1257,17,Sense and Sensibility (1995),Drama,Romance,6,4,978236383,632,632,632,632,632,632
2316,25,Leaving Las Vegas (1995),Drama,Romance,8,5,978229477,603,603,603,603,603,603
3077,32,Twelve Monkeys (1995),Drama,Sci-Fi,5,4,978244962,1083,1083,1083,1083,1083,1083

In [52]:
def weighted_rating(exp1, m=m, C=C):
    v = exp1['Ratings_count']
    R = exp1['Ratings']
    # Calculation based on the IMDB formula
    return (v/(v+m) * R) + (m/(m+v) * C)

In [53]:
q_movies['Score'] = q_movies.apply(weighted_rating, axis=1)

In [54]:
q_movies = q_movies.sort_values('Score', ascending=False)
#q_movies[['Movie_id','Title','Ratings_count', 'Ratings', 'score','category 1','category 2']]

In [55]:
#q_movies.drop(axis=1,columns=['User_id','Timestamp'], inplace=True)

In [56]:
#finally the rcommended movies 
q_movies.head()

,Movie_id,Title_x,category 1_x,category 2_x,User_id_x,Ratings,Timestamp_x,Title_y,category 1_y,category 2_y,User_id_y,Ratings_count,Timestamp_y,Score
124702,2028,Saving Private Ryan (1998),Action,Drama,1,5,978301619,2260,2260,2260,2260,2260,2260,4.897740
37095,593,"Silence of the Lambs, The (1991)",Drama,Thriller,2,5,978298517,2252,2252,2252,2252,2252,2252,4.897433
32005,527,Schindler's List (1993),Drama,War,1,5,978824195,2071,2071,2071,2071,2071,2071,4.889963
22890,318,"Shawshank Redemption, The (1994)",Drama,None,2,5,978298413,2046,2046,0,2046,2046,2046,4.888845
7383,110,Braveheart (1995),Action,Drama,2,5,978298625,1977,1977,1977,1977,1977,1977,4.885638